import Mock from "mockjs";

export default {
    costom: () => ({
        code: 200,
        data: [{
            id: 1,
            name: '小丑',
            score: 7.7,
            stars: '杰昆·菲尼克斯',
            tag: ['犯罪' ,'惊悚'],
            region: '美国',
            img:"https://gss1.bdstatic.com/9vo3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=9a09e203ae8b87d65042ac193f334f05/bd315c6034a85edfa4a4ae1146540923dd5475d3.jpg",
            company:"华纳兄弟影片公司",
            introduce: '亚瑟·弗莱克是一个和母亲住在老旧公寓里，需要靠社会福利组织帮助，不断服用精神疾病药物的小丑。他想成为一个脱口秀演员，但并不成功。人们只是嘲笑他。他在地铁上爆发式地犯下了谋杀案。他的世界，就此一点一滴地开始崩塌了'
        },
        {
            id: 2,
            name: '蜘蛛侠：英雄归来',
            score: 7.7,
            stars: '汤姆·赫兰德',
            tag: ['犯罪' ,'惊悚','动作'],
            region: '美国',
            img:"https://dss2.bdstatic.com/6Ot1bjeh1BF3odCf/it/u=4024238078,19128336&fm=74&app=80&f=JPEG&size=f121,140?sec=1880279984&t=6ea8690e6ae68635ab950c5620584f3d",
            company:"索尼电影娱乐公司",
            introduce: '在英雄内战机场大战落幕后，彼得·帕克（汤姆·赫兰德饰）在恩师托尼·斯塔克（小罗伯特·唐尼饰）的协助下，试图在一名普通高中生和打击犯罪的超级英雄蜘蛛侠间保持平衡，但反派秃鹫（迈克尔·基顿饰）的崛起让人们面临新的威胁。钢铁侠作为蜘蛛侠的导师再次出现，作为引导他踏上英雄之路的关键人物，确保他在未来有资格成为复仇者联盟的一分子',
        },
        {
            id:3,
            name:'黑暗骑士',
            score: 9.8,
            stars:'克里斯蒂安·贝尔',
            tag:['犯罪' ,'惊悚'],
            region:'美国',
            img:"https://dss0.baidu.com/6ONWsjip0QIZ8tyhnq/it/u=99426273,3373647495&fm=58&w=121&h=140&img.JPEG",
            company:"华纳兄弟影片公司",
            introduce:'故事从小丑带着手下抢了一家黑道的银行开始，手下们被小丑的伎俩玩弄，开始自相残杀。当假冒的蝙蝠侠试着阻碍黑道与稻草人之间的毒品交易。此时真的蝙蝠侠现身，而后他在战斗中因为盔甲太过笨重而受了伤，让他想重新设计蝙蝠装。蝙蝠侠、高登队长和新的检察长哈维丹特计划将黑帮斩草除根，哈维就能当上公开的英雄。同时布鲁斯发现瑞秋在与丹特交往。'
        },
        {
            id:4,
            name:'超人：钢铁之躯',
            score: 8.8,
            stars:'亨利·卡维尔',
            tag:['冒险' ,'动作'],
            region:'美国',
            img:"https://dss1.baidu.com/6ONXsjip0QIZ8tyhnq/it/u=2555150221,549645307&fm=179&app=42&f=JPG?w=121&h=140",
            company:"华纳兄弟影片公司",
            introduce:'随着氪星的毁灭，氪星人乔·艾尔（罗素·克劳饰）抵死反抗佐德将军（迈克尔·珊农饰）的邪恶计划，冒险将刚出生不久的儿子卡尔·艾尔被送到银河系另一边的地球，飞船坠落在美国堪萨斯州斯莫威尔小镇的肯特农场，卡尔·艾尔被好心的肯特夫妇拾获，并以克拉克·肯特的地球名字抚养成人。'

        },
        {
            id:5,
            name:'闪电侠',
            score: 7.9,
            stars:'埃兹拉·米勒',
            tag:['犯罪' ,'动作'],
            region:'美国',
            company:"华纳兄弟影片公司",
            img:"https://dss0.bdstatic.com/6Ox1bjeh1BF3odCf/it/u=2506265275,2999167566&fm=74&app=80&f=JPEG&size=f121,140?sec=1880279984&t=4231fbaa62d1574093574f6a6bf25cfc",
            introduce:'剧情将围绕《闪点》展开。由于本片还没定导演，因此不知道会采取多少“闪点”中的情节。'
        }

        ]
    })
};